src/Catalogs/Компьютеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Компьютеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Память</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процессор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрядность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Компьютеры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	РегистрыСведений.РолиКомпьютеров.ОбновитьДляКомпьютера(Ссылка);
	Если ПустаяСтрока(IP) Тогда
		IP = "?";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанные(Инфо = Неопределено) Экспорт

	ОбновитьРеквизиты("Наименование", Инфо, "computername");
	ОбновитьРеквизиты("ВерсияОС", Инфо, "osversion");
	ОбновитьРеквизиты("ВерсияПлатформы", Инфо, "platformversion");
	ОбновитьРеквизиты("ТипПлатформы", Инфо, "platformtype");
	ОбновитьРеквизиты("Память", Инфо, "memory");
	ОбновитьРеквизиты("Процессор", Инфо, "cpu");
	
	Инфо_Разрядность = ОпределитьРазрядность(Инфо);
	Если НЕ Разрядность = Инфо_Разрядность Тогда
		Разрядность = Инфо_Разрядность;
	КонецЕсли;
	
	Если ПроверкаИзмененности.ОбъектИзменен(ЭтотОбъект) Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРеквизиты(ИмяРеквизита, Инфо, ИмяСвойства)

	Если НЕ СокрЛП(ЭтотОбъект[ИмяРеквизита]) = СокрЛП(Инфо[ИмяСвойства]) Тогда
		ЭтотОбъект[ИмяРеквизита] = СокрЛП(Инфо[ИмяСвойства]);
	КонецЕсли;

КонецПроцедуры


Функция ОпределитьРазрядность(Инфо)

	Если СтрНайти(Инфо.platformtype, "64") Тогда
		Возврат "64";
	ИначеЕсли  СтрНайти(Инфо.bindir, "86)") Тогда
		Возврат "64";
	Иначе
		Возврат "32";
	КонецЕсли;

КонецФункции
